Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཇུག་པར་བྱེད་པའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as mindfulness that leads to engagement.

source: ཡོངས་སུ་གཅོད་པའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as mindfulness of ascertainment.

source: འདི་དག་ནི་དྲན་པ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing mindfulness.

source: དེ་ལ་ཏིང་ངེ་འཛིན་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing absorption?

source: ཚད་མེད་པ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as absorption that embraces the immeasurable qualities.

source: ཡང་དག་པའི་སྤོང་བ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as absorption that embraces the correct abandonments.

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as absorption that embraces the bases of miraculous power.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as absorption that embraces the applications of mindfulness.

source: བསམ་གཏན་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as absorption that embraces the concentrations.

source: བདེན་པ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as absorption that embraces the truths.

source: འདི་དག་ནི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing absorption.

source: དེ་ལ་ཤེས་རབ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing insight?

source: དབང་པོ་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as insight that embraces the faculties.

source: སྟོབས་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as insight that embraces the powers.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as insight that embraces the factors of awakening.

source: ལམ་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as insight that embraces the path.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as insight that embraces dependent origination.

source: སྟོབས་བཅུ་ཡོངས་སུ་འཛིན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as insight that embraces the ten powers.

source: འདི་དག་ནི་ཤེས་རབ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing insight.

source: དེ་ལ་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of unfailing liberation?

source: ལུས་ཉམ་ཆུང་བ་ཡོངས་སུ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as unfailing strength of the body.

source: ཚོགས་ཀྱི་ནང་ན་གནས་པས་ཡོངས་སུ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as unfaltering presence in the assembly.

source: མ་འདྲེས་པར་གནས་པས་ཡོངས་སུ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as unfaltering presence free from mingling.

source: གཞན་གྱི་གནས་ཐོབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the attainment of other supports.

source: ཟད་པ་ཤེས་པས་ལེགས་པར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as excellent action due to the knowledge of exhaustion.

source: མི་སྐྱེ་བ་ཤེས་པས་བག་ཆགས་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as freedom from karmic imprints due to the knowledge of nonarising.

source: འདི་དག་ནི་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of unfailing liberation.

source: དེ་ལ་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the unfailing vision of liberated wisdom?

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་རྣམ་པར་གྲོལ་བ་ཡེ་ཤེས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing liberated wisdom according to one’s wishes.

source: སྡོམ་པ་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing that there are no religious vows.

source: འདོད་པར་འགྱུར་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the desirable.

source: ས་དང་ས་མ་ཡིན་པའི་འབྲས་བུ་རྣམ་པར་གཞག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as establishing what result is a spiritual level and what result is not.

source: སྐྱེ་བ་རྣམ་པར་གཞག་པ་ལ་མི་སློབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not persisting in establishing birth.

source: ཆོས་གོས་ཀྱི་ཐ་མས་ཁྱེར་བ་ན་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཤེས་རབ་རྣམ་པར་གྲོལ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as unfailing liberated insight when carrying the simplest Dharma robes.

source: འདི་དག་ནི་རྣམ་པར་གྲོལ་བ་ཡེ་ཤེས་མཐོང་བ་ཡོངས་སུ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the unfailing perception of liberated wisdom.

source: དེ་ལ་ལུས་ཀྱི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of physical actions being preceded by wisdom?

source: ལུས་ཀྱི་ལས་མ་འཁྲུལ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as having no delusions about physical actions.

source: ལུས་ཀྱི་ལས་ངེས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline comprises noble acts of the body.

source: བག་ཆགས་ཀྱིས་འགྱུར་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་འོ། །
en: Patience ripens as being unaffected by karmic imprints.

source: གཅིག་ཏུ་དགེ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being entirely wholesome.

source: སྐྱེ་བོ་མང་པོ་ལ་རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as ripening many beings.

source: ལུས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་གདམས་ངག་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight consists in imparting instructions by way of physical miraculous displays.

source: འདི་དག་ནི་ལུས་ཀྱི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of physical actions being preceded by wisdom.

source: དེ་ལ་ངག་གི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of verbal actions being preceded by wisdom?

source: ངག་འཁྲུལ་པ་མེད་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as having unconfused speech.

source: ཐམས་ཅད་དུ་སོང་བའི་དབྱངས་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as a voice that reaches all.

source: འཁོར་དགའ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as delighting the assembly.

source: ཀུན་ཏུ་སྒྲོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as widespread proclamations.

source: མོས་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as having dedication.

source: རེ་བ་ལ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as teaching that pertains to what is hoped for.

source: འདི་དག་ནི་ངག་གི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of verbal actions being preceded by wisdom.

source: དེ་ལ་ཡིད་ཀྱི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of mental actions being preceded by wisdom?

source: ཡིད་ཀྱི་ལས་རང་བཞིན་གྱིས་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the natural continuity of mental actions.

source: རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as relinquishing attachment and anger.

source: སོ་སོར་བརྟགས་པ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the practice of analysis.

source: ངའོ་སྙམ་པའི་ང་རྒྱལ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as relinquishing the pride of thinking, ‘I am.’

source: གཏི་མུག་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as freedom from closed-mindedness.

source: ཚད་མེད་པས་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as maintaining the immeasurable qualities.

source: འདི་དག་ནི་ཡིད་ཀྱི་ལས་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of mental actions being preceded by wisdom.

source: དེ་ལ་འདས་པའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the unhindered wisdom that perceives the past?

source: ཁམས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding the elements.

source: ཕུང་པོ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding the aggregates.

source: སྐྱེ་མཆེད་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding the sense sources.

source: ལས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding karma.

source: ཉོན་མོངས་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding defilements.

source: སེམས་ཅན་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding sentient beings.

source: འདི་དག་ནི་འདས་པའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the unhindered wisdom that perceives the past.

source: དེ་ལ་མ་འོངས་པའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the unhindered wisdom that perceives the future?

source: འགྲོ་བ་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as understanding of different existences.

source: ལྟ་བ་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding of different views.

source: གང་ཟག་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding different kinds of person.

source: སྦྱོར་བ་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding of different engagements.

source: སྐྱེ་བ་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as understanding of different births.

source: རྣམ་པར་སྨིན་པ་ཐ་དད་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding of different forms of ripening.

source: འདི་དག་ནི་མ་འོངས་པའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the unhindered wisdom that perceives the future.

source: དེ་ལ་ད་ལྟར་བྱུང་བའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the vision of unhindered wisdom in the present moment?

source: ད་ལྟར་བྱུང་བའི་དུས་ཀྱི་བྱ་བ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as knowledge of actions occurring in the present.

source: མྱ་ངན་ལས་འདས་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing nirvāṇa.

source: འདོད་ཆགས་དང་བྲལ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the absence of desire.

source: འགོག་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing cessation.

source: མངོན་སུམ་དུ་བྱ་བ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as direct perception of actions.

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ལ་ཆུད་ཟ་བ་མེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as seeing the nondissipation of the conditioned and the unconditioned.

source: འདི་དག་ནི་ད་ལྟར་བྱུང་བའི་དུས་ལ་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the vision of unhindered wisdom in the present moment.

source: དེ་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of expertise?

source: ཐབས་མཁས་པས་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as discernment through skillful means.

source: སྐྱོན་དང་བྲལ་བར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as flawless engagement.

source: ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as dedication.

source: ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being thoroughly unimpeded.

source: སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as comprehending the inclinations of sentient beings.

source: བདེ་བ་ཚད་མེད་པ་ལ་འཇུག་པ་ཐོབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as attaining an understanding of immeasurable happiness.

source: འདི་དག་ནི་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of expertise.

source: དེ་ལ་ཇི་ལྟ་བ་བཞིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of how things are?

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་སྦྱོར་བ་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as unimpeded wisdom that engages with all phenomena within equality.

source: དངོས་པོ་བརྒྱད་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as perception of the eight topics.

source: ལྟ་བ་གསལ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the clear perception of the view.

source: གདུལ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the perception of the training.

source: ཉེ་བར་སྒྲུབ་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the perception of accomplishment.

source: བརྡ་ལ་ངེས་པའི་ཚིག་འཇུག་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the perception of how language relates to symbols.

source: འདི་དག་ནི་ཇི་ལྟ་བ་བཞིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of how things are.

source: དེ་ལ་རང་བཞིན་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of seeing the nature of things?

source: མི་དམིགས་པས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ནི་དཔེར་ན་མར་མེ་མཛད་ལྟ་བུའི་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as generosity dedicated through nonapprehension, as exemplified by Dīpaṅkara.

source: ལུས་ལ་མི་ལྟ་བ་ནི་དཔེར་ན་ཟླ་འོད་ཀྱིས་བདེན་པ་གང་གིས་ངའི་མིག་ཅེས་སྨྲས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as no concern for the body, as exemplified by Candraprabha, who said, ‘By means of the truth, here are my eyes.’

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the equality of all phenomena.

source: ལྗོངས་ཀྱི་ངེས་པའི་ཚིག་མཐོང་བར་ཁོང་དུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the comprehension of the language of the land.

source: སྙིང་བརྩེ་བ་མི་གཏོང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as never abandoning a loving heart.

source: གཉིས་སུ་མེད་པས་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as abiding by nonduality.

source: འདི་དག་ནི་རང་བཞིན་མཐོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of seeing the nature of things.

source: དེ་ལ་འདོད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the actions of the desire realm?

source: འདོད་པ་ན་སྤྱོད་པའི་ལས་དམན་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the inferior actions of the desire realm.

source: འབྲིང་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the intermediate actions.

source: ཆེན་པོ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the great actions.

source: ལས་ཟད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as seeing the exhaustion of actions.

source: ལས་ཟད་པར་སྦྱོར་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as seeing the engagements that bring actions to exhaustion.

source: ལས་ཟད་པར་སྦྱོར་བའི་མི་སྐྱེ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as seeing the nonarising of the engagements that bring actions to exhaustion.

source: འདི་དག་ནི་འདོད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the actions of the desire realm.

source: དེ་ལ་གཟུགས་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the actions of the form realm?

source: གཟུགས་ཀྱི་རྣམ་པར་སྨིན་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the ripening of form.

source: གཟུགས་ཀྱི་རྒྱུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the causes of form.

source: སྐྱེ་བའི་ལས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing the actions associated with birth.

source: སྐྱེ་བའི་ལས་ཀྱི་རྣམ་པར་རྟོག་པ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding the thoughts based on the actions of birth.

source: རྣམ་པར་སྨིན་པ་གསལ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the clear seeing of ripening.

source: དམན་པ་དང་དམན་པ་མ་ཡིན་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as seeing what is inferior and what is not inferior.

source: འདི་དག་ནི་གཟུགས་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of the actions of the form realm.

source: དེ་ལ་གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the actions of the formless realm?

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའི་ས་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the pure levels of the meditative attainments of the formless realm.

source: རྣམ་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as understanding of their features.

source: དམིགས་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as understanding of the focal points.

source: དམིགས་པ་ལ་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the equality of apprehensions.

source: དམིགས་པ་ཤིན་ཏུ་སྦྱངས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the highly purified apprehensions.

source: ཐ་དད་པ་མེད་པར་སྟོན་པར་མཐོང་བ་ནས་ངེས་པར་འབྱུང་བ་མཐོང་བའི་བར་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as everything from seeing the teaching on the lack of distinctions through to seeing deliverance.

source: འདི་དག་ནི་གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the actions of the formless realm.

source: དེ་ལ་དཀར་པོ་རྣམ་པར་མཐོང་བའི་སའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the level of seeing the virtuous?

source: དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ལ་རེ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the absence of hopes for the level of seeing the virtuous.

source: མཚན་མ་མེད་པ་རབ་ཏུ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as attaining signlessness.

source: རྣམ་པར་ལྟ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as viewing.

source: ཀུན་ཏུ་འཕེལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as increasing.

source: དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ལ་ཆོས་སུ་འདུ་ཤེས་ཤིང་སེམས་ཅན་གྱི་འདུ་ཤེས་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as the conception that clearly seeing the virtuous is the Dharma and as the absence of the conception of a sentient being.

source: འདི་དག་ནི་དཀར་པོ་རྣམ་པར་མཐོང་བའི་སའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the level of seeing the virtuous.

source: དེ་ལ་རིགས་ཀྱི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of the spiritual potential?

source: རིགས་ཀྱི་ཆོས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as seeing the qualities of the spiritual potential.

source: འབྲིང་པོ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the intervening phase.

source: སྲེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing craving.

source: རིགས་ལས་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as never departing from the spiritual potential.

source: རིགས་ཡོངས་སུ་རྫོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the perfection of the spiritual potential.

source: བརྒྱད་པའི་ཆོས་རབ་ཏུ་འཐོབ་པའི་སེམས་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as the mind that attains the qualities of the eighth.

source: འདི་དག་ནི་རིགས་ཀྱི་སའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the qualities of the level of the spiritual potential.

source: དེ་ལ་བརྒྱད་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of the eighth?

source: བརྒྱད་པ་དད་པའི་རྗེས་སུ་འབྲང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as following the eighth with faith.

source: བརྒྱད་པ་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as following the Dharma of the eighth.

source: བརྒྱད་པ་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the arising of the eighth.

source: བརྒྱད་པ་དགྲ་བཅོམ་པ་སྟན་གཅིག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being a worthy one with a single seat with respect to the eighth.

source: བརྒྱད་པ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་རབ་ཏུ་གནས་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as abiding within the fruitions of a stream enterer, once-returner, and non-returner with respect to the eighth.

source: གཉི་གའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་གང་གིས་སོ་སོ་ཡང་དག་པར་རིག་པ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as liberation from both ways of seeing a person and attaining correct understanding.

source: འདི་དག་ནི་བརྒྱད་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the qualities of the eighth.

source: དེ་ལ་རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of a stream enterer?

source: རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱི་ལམ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའིའོ། །
en: Generosity ripens as understanding the path of the qualities of a stream enterer.

source: རྣོ་བར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as sharp understanding.

source: དེ་ལྟར་ཐོགས་ན་ལན་བདུན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being reborn seven times at the most.

source: རིགས་ནས་རིགས་སུ་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as continuous rebirth within a proper family.

source: བར་ཆད་གཅིག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as there being a single obstacle.

source: ཞུགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as having gained entry.

source: འདི་དག་ནི་རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the qualities of a stream enterer.

source: དེ་ལ་ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the qualities of a once-returner?

source: ལན་ཅིག་ཕྱིར་འོང་བ་ལ་ཉོན་མོངས་པ་ཆུང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའིའོ། །
en: The perfection of generosity ripens as seeing that the once-returner has fewer defilements.

source: ཉོན་མོངས་པ་རྣོ་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as sharp perception of the defilements.

source: ལས་ཆུང་བར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seeing that karma has diminished.

source: ལས་ལ་སྲེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the perception of craving with respect to karma.

source: བུལ་བ་ཉིད་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the seeing of stupefaction.

source: ལྷག་པར་སྲེད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: The perfection of insight ripens as the seeing of strong craving.

source: འདི་དག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the qualities of a once-returner.
